import 'package:flutter/material.dart';

class Zeker_model {
  final String category;
  final int count;
  final String description;
  final String reference;
  final String content;

  Zeker_model({
    required this.category,
    required this.count,
    required this.description,
    required this.reference,
    required this.content,
  });
}





List<String> azkarCategories=[
  'ازكار الصباح',
  'ازكار المساء',
  'ازكار بعد الصلاه',
  'ازكار النوم'
];

List <Zeker_model> azkarElsabah=[
  Zeker_model(
    category: "أذكار الصباح",
    count: 1,
    description: "",
    reference: "",
    content: "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 1,
    description: "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
    reference: "",
    content: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
    reference: "",
    content: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 4,
    description: "من قالها أعتقه الله من النار.",
    reference: "",
    content: "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 7,
    description: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
    reference: "",
    content: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "لم يضره من الله شيء.",
    reference: "",
    content: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 1,
    description: "",
    reference: "",
    content: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 1,
    description: "",
    reference: "",
    content: "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "",
    reference: "",
    content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "",
    reference: "",
    content: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "",
    reference: "",
    content: "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 1,
    description: "",
    reference: "",
    content: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
  ),
  Zeker_model(
    category: "أذكار الصباح",
    count: 3,
    description: "",
    reference: "",
    content: "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
  ),
];

List<Zeker_model>azkarElmasaa=[

 
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "",
      reference: "",
      content: "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      reference: "",
      content: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 3,
      description: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
      reference: "",
      content: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 4,
      description: "من قالها أعتقه الله من النار.",
      reference: "",
      content: "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "من قالها حين يمسى أدى شكر يومه.",
      reference: "",
      content: "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 7,
      description: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
      reference: "",
      content: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 3,
      description: "لم يضره من الله شيء.",
      reference: "",
      content: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "",
      reference: "",
      content: "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "",
      reference: "",
      content: "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 3,
      description: "",
      reference: "",
      content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 3,
      description: "",
      reference: "",
      content: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 3,
      description: "",
      reference: "",
      content: "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ."
    ),
    Zeker_model(
      category: "أذكار المساء",
      count: 1,
      description: "",
      reference: "",
      content: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمن"
    )
];
List<Zeker_model>aftarElsalah=[
   Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "",
      reference: "",
      content: "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.\nاللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام ."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "",
      reference: "",
      content: "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "",
      reference: "",
      content: "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 33,
      description: "",
      reference: "",
      content: "سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "",
      reference: "",
      content: "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 10,
      description: "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.",
      reference: "",
      content: "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "بَعْد السّلامِ من صَلاةِ الفَجْر.",
      reference: "",
      content: "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 7,
      description: "بعد صلاة الصبح والمغرب.",
      reference: "",
      content: "اللَّهُمَّ أَجِرْنِي مِنْ النَّار."
    ),
    Zeker_model(
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: 1,
      description: "",
      reference: "",
      content: "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ."
    ),
];
List<Zeker_model>sleepingAzkar=[
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 3,
    description: "",
    reference: "",
    content: "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم ."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 1,
    description: "",
    reference: "",
    content: "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 33,
    description: "",
    reference: "",
    content: "سُبْحَانَ اللَّهِ."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 33,
    description: "",
    reference: "",
    content: "الْحَمْدُ لِلَّهِ."
  ),
  Zeker_model(
    category: "أذكار النوم",
    count: 34,
    description: "",
    reference: "",
    content: "اللَّهُ أَكْبَرُ."
  ),
];

List <String> DoaaCategoriesList=[
  "ادعيه قرءانيه",
  "ادعيه نبويه"

];

List<Zeker_model> DoaaQuraania_list = [
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [البقرة - 201].",
    content: "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. [البقرة - 201]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [البقرة - 250].",
    content: "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة - 250]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [البقرة - 286].",
    content: "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة - 286]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 8].",
    content: "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ. [آل عمران - 8]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 16].",
    content: "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ. [آل عمران - 16]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 38].",
    content: "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء. [آل عمران - 38]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 53].",
    content: "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ. [آل عمران - 53]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 147].",
    content: "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [آل عمران - 147]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [آل عمران - 191-194].",
    content: "رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ. [آل عمران - 191-194]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [الأعراف - 23].",
    content: "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ. [الأعراف - 23]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [الأعراف - 47].",
    content: "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ. [الأعراف - 47]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [الأعراف - 126].",
    content: "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ. [الأعراف - 126]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [التوبة - 129].",
    content: "حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ. [التوبة - 129]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [يونس - 85-86].",
    content: "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ. [يونس - 85-86]."
  ),
  Zeker_model(
    category: "أدعية قرآنية",
    count: 1,
    description: "",
    reference: ". [هود - 47].",
    content: "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي")];

    List<Zeker_model> DoaaNaboia_list = [
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "آدم علية السلام.",
    reference: ". [الأعراف - 23].",
    content: "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ. [الأعراف - 23]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "نوح علية السلام.",
    reference: ". [نوح - 28].",
    content: "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا. [نوح - 28]. رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ. [هود - 47]. رَّبِّ أَنزِلْنِي مُنزَلاً مُّبَارَكاً وَأَنتَ خَيْرُ الْمُنزِلِينَ. [المؤمنون - 29]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "إبراهيم علية السلام.",
    reference: ". [هود - 47].",
    content: "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40) رَبَّنَا اغْفِرْ لِي "),
 
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "لوط علية السلام.",
    reference: ". [البقرة - 127-128].",
    content: "رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ. [العنكبوت - 30]. رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ. [الشعراء - 169]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "يوسف علية السلام.",
    reference: ". [إبراهيم - 40-41].",
    content: "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ. [يوسف - 101]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "شعيب علية السلام.",
    reference: ". [الشعراء - 83-85].",
    content: "وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ. [الأعراف - 89]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "موسى علية السلام.",
    reference: ". [الممتحنة - 4-5].",
    content: "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي. [القصص - 16]. رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ. [القصص - 17]. رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ. [القصص - 24]. رَبِّ اشْرَحْ لِي صَدْرِي (25) وَيَسِّرْ لِي أَمْرِي (26) وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي (27) يَفْقَهُوا قَوْلِي (28). [طه - 25-28]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "أيوب علية السلام.",
    reference: ". [الصافات - 100].",
    content: "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ. [الأنبياء - 83]."
  ),
  Zeker_model(
    category: "أدعية الأنبياء",
    count: 1,
    description: "سليمان علية السلام.",
    reference: ". [هود - 56].",
    content: "رَبِّ أَوْزِعْ")];
